src/main/resources/examples/xmlPayload.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope
   xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
   <env:Header>
       <wsse:Security env:mustUnderstand="1">
           <wsse:UsernameToken>
               <wsse:Username>Username</wsse:Username>
               <wsse:Password
                   Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Pass</wsse:Password>
           </wsse:UsernameToken>
       </wsse:Security>
   </env:Header>
   <env:Body>
       <wd:Move_Workers_By_Organization_Request
           xmlns:wd="urn:com.workday/bsvc"
           wd:version="v35.0">
           <wd:Business_Process_Parameters>
               <wd:Auto_Complete>true</wd:Auto_Complete>
               <wd:Run_Now>true</wd:Run_Now>
           </wd:Business_Process_Parameters>
           <wd:Move_Workers_By_Organization_Data>
               <wd:Effective_Date>2021-11-01</wd:Effective_Date>
               <wd:From_Organization_Reference>
                   <wd:ID wd:type="Organization_Reference_ID">111</wd:ID>
               </wd:From_Organization_Reference>
               <wd:Move_Workers_By_Organization_Position_Data>
                   <wd:Position_ID>Test123</wd:Position_ID>
               </wd:Move_Workers_By_Organization_Position_Data>
               <wd:To_Organization_Reference>
                   <wd:ID wd:type="Organization_Reference_ID">3333</wd:ID>
               </wd:To_Organization_Reference>
           </wd:Move_Workers_By_Organization_Data>
       </wd:Move_Workers_By_Organization_Request>
       <wd:Move_Workers_By_Organization_Request
           xmlns:wd="urn:com.workday/bsvc"
           wd:version="v35.0">
           <wd:Business_Process_Parameters>
               <wd:Auto_Complete>true</wd:Auto_Complete>
               <wd:Run_Now>true</wd:Run_Now>
           </wd:Business_Process_Parameters>
           <wd:Move_Workers_By_Organization_Data>
               <wd:Effective_Date>2021-11-05</wd:Effective_Date>
               <wd:From_Organization_Reference>
                   <wd:ID wd:type="Organization_Reference_ID">111</wd:ID>
               </wd:From_Organization_Reference>
               <wd:Move_Workers_By_Organization_Position_Data>
 			<wd:Position_ID>Test456</wd:Position_ID>
               </wd:Move_Workers_By_Organization_Position_Data>
               <wd:To_Organization_Reference>
                   <wd:ID wd:type="Organization_Reference_ID">3333</wd:ID>
               </wd:To_Organization_Reference>
           </wd:Move_Workers_By_Organization_Data>
       </wd:Move_Workers_By_Organization_Request>
   </env:Body>
</env:Envelope>
